<template>
  <footer>
    <div id="paragraph">
      <br>
      <p>
        <strong>ปุกาดๆ :</strong>
        ตอนนี้เว็บไซต์อินทนิลเปิดให้บริการแล้ว โดยมีการพัฒนาโดย
        <a href="">นายณภัทร โตสวาท</a>
        นักเรียนโรงเรียนเตรียมอุดมศึกษาน้อมเกล้า สามารถติดต่อแจ้งแก้ไขปัญหาได้เลยผ่านช่องทางด้านล่าง
      </p>
      <br>
      <p>
        เว็บไซต์เปิดให้บริการอย่างเป็นทางการเมื่อวันที่ :
        <strong>1 มิถุนายน พ.ศ.2569</strong>
      </p>
      <p>
        สัญญาการให้บริการจะสิ้นสุดลงในวันที่ :
        <strong>1 มีนาคม พ.ศ.2570</strong>
      </p>
      <p>
        อย่างไรก็ตามข้อมูลนี้ยังคงคลาดเคลื่อนได้เป็นไปตามข้อตกลงภายใน
        <a href="">สัญญาการให้บริการ</a>
        ที่ผู้รับผิดชอบเว็บไซต์และผู้รับผิดชอบคณะสีตกลงกัน
      </p>
      <br>
    </div>
  </footer>
</template>

<style scoped>
  footer {
    width: 100%;
    height: fit-content;
  }

  #paragraph {
    height: fit-content;
    background-color: var(--c-bl1);

    padding: 10px;
    color: var(--c-w1);
  }
</style>